src/DataProcessors/СкрытьМенюИПанели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СкрытьМенюИПанели</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПродолжитьЗапускРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/СкрытьМенюИПанели/Forms/Форма/module.bsl
//Перем Враппер;
Перем pid;
Перем a,a2,AHKСкрыть;
Перем СчетчикСнятых, счОшибок;
Перем файл, ИФ, ИФ2;
Перем фМожноЗакрыть Экспорт;

Процедура ВызватьКонтекстноеМеню() Экспорт
	Текст = "
	|#NoTrayIcon
	|
	|if (ErrorLevel=0)
	|SetWinDelay, 500
	|SetWinDelay, 500
	|sleep 200
	|{	
	|WinActivate, 
	|hwnd := WinActive(""ahk_pid %1"")
	|COORDMODE,PIXEL,client
	|COORDMODE,mouse,client
	|controlClick, V8MDIClient1,ahk_id %hwnd%, , Right,,X1 Y1
	|}";
	Текст = СтрЗаменить(текст,"%1",Формат(pid,"ЧРГ=; ЧГ=0"));
	a2.ahkTextDll(текст);
	//Если a2.ahkReady() Тогда 
	//	//ОбработкаПрерыванияПользователя();
	//	Враппер.sleep(100);
	//КонецЕсли;
	ПодключитьОбработчикОжидания("СнятьФлаг",0.1,1);			
КонецПроцедуры

Процедура СнятьФлаг() Экспорт 
	
	
	Текст="	
	|	#NoTrayIcon
	|	; sleep 100
	|	f()
	|	exitApp
	|	f()
	|
	|	{
	|	hwnd := WinActive(""ahk_pid %1"")	
	|	PixelSearch, X, Y, 1, 1, 30, 500, 0xC7dcF5    ,0,FAST
	|	if (ErrorLevel=0) 
	|	{
	|		mouseclick, left, %X%,%Y%
	|	}
	|	else 
	|	{
	|		file := FileOpen(%2, ""w"")
	|		TestString := ""1123132123""
	|		file.Write(TestString)
	|		file.Close()
	|		;send {esc}
	|
	| 	}
	| 	}
	|	" ;
	Текст = СтрЗаменить(текст,"%1",Формат(pid,"ЧРГ=; ЧГ=0"));
	Текст = СтрЗаменить(текст,"%2",ИФ2);
	a2.ahkTextDll(текст);
	//a2.ahkFunction("f");
	Если a2.ahkReady() Тогда 
		//ОбработкаПрерыванияПользователя();
		//Враппер.sleep(500);
	КонецЕсли;
	Если файл.Размер()>4 Тогда
		счОшибок=счОшибок+1;
		ИФ = ПолучитьИмяВременногоФайла();
		файл = Новый файл(иф);
		Т = Новый ТекстовыйДокумент;
		Т.Записать(иф); 		
		ИФ2 = """"+иф+"""";
	КонецЕсли;
	Если счОшибок >= 3 Тогда
		Попытка
			Закрыть();
		Исключение
		КонецПопытки;
		Возврат
	КонецЕсли;
	
	СчетчикСнятых=СчетчикСнятых+1;
	Если СчетчикСнятых < 8 Тогда
		ПодключитьОбработчикОжидания("ВызватьКонтекстноеМеню",0.5,1);
	Иначе 
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	//Если a2 = Неопределено Тогда 
	//	фМожноЗакрыть = 1;
	//	Закрыть();
	//КонецЕсли;
	Если Тест Тогда
		ПродолжитьЗапускРабочегоМеста = Истина;
		Закрыть();	
		Возврат;
	КонецЕсли;
	Если глРабочееМесто.МестоРеализации = Справочники.МестаРеализации.Ресторан Тогда
		РаботаСокнами.УстановитьРазмерОкна(,1024, 786);
	
	КонецЕсли;
		
	ПодключитьОбработчикОжидания("РаботаСокнамиСкрытьМенюИпанели", 0.1, 1);
КонецПроцедуры

Процедура РаботаСокнамиСкрытьМенюИпанели() Экспорт
	AHKСкрыть = РаботаСокнами.СкрытьМенюИПанели();
	РаботаСокнами.Максимизировать();
	ПодключитьОбработчикОжидания("Закрыть_",3,1);	
КонецПроцедуры

Процедура Закрыть_() Экспорт
	Если AHKСкрыть.ahkready()=0 Тогда
		Закрыть();
	Иначе
		Если AHKСкрыть.ahkFunction("GetVisibleCount")<>"0" Тогда  
			AHKСкрыть = РаботаСокнами.СкрытьМенюИПанели();
			ПодключитьОбработчикОжидания("Закрыть_",3,1);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)

КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Если РаботаСокнами = Неопределено Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры           

Процедура ПриЗакрытии()
	Если ПродолжитьЗапускРабочегоМеста Тогда
		ИнтерфейсРМ.ПродолжитьЗапускРабочегоМеста(Тест);
	КонецЕсли;
	КонецПроцедуры
